app/Modules/Backend/ProductManagement/Http/Controllers/CategoryController.php

    public function categoryList(Request $request)
    {
        $draw = $request->get('draw');
        $start = $request->get("start");
        $rowperpage = $request->get("length"); // total number of rows per page

        $columnIndex_arr = $request->get('order');
        $columnName_arr = $request->get('columns');
        $order_arr = $request->get('order');
        $search_arr = $request->get('search');

        $columnIndex = $columnIndex_arr[0]['column']; // Column index
        $columnName = $columnName_arr[$columnIndex]['data']; // Column name
        $columnSortOrder = $order_arr[0]['dir']; // asc or desc
        $searchValue = $search_arr['value']; // Search value

        $query = Category::query();
        // Total records
        $totalRecords = $query->count();
        $totalRecordswithFilter = $totalRecords;
        // Get records, also we have included search filter as well
        if (!empty($searchValue)) {
            $query
                ->where('name', 'like', '%' . $searchValue . '%')
                ->orWhere('order', 'like', '%' . $searchValue . '%')
                ->orWhere('id', 'like', '%' . $searchValue . '%');
            $totalRecordswithFilter = $query->count();
        }
        $records = $query
            ->with('parents')
            ->orderBy($columnName, $columnSortOrder)
            ->skip($start)
            ->take($rowperpage)
            ->get();
---
select count(*) as aggregate from `categories` where `categories`.`deleted_at` is null
select * from `categories` where `categories`.`id` in ('', 937, 938) and `categories`.`deleted_at` is null

    public function create()
    {
        $category = new Category();
        $categories = Category::select('id', 'name', 'category_id')->where('is_active', 1)->orderBy('id', 'asc')->get();
---
select `id`, `name`, `category_id` from `categories` where `is_active` = 1 and `categories`.`deleted_at` is null order by `id` asc

    public function edit($id)
    {
        $category = Category::findOrFail($id);
---
select * from `categories` where `categories`.`id` = '1019' and `categories`.`deleted_at` is null limit 1

    public function update(Request $request, $id)
    {
        try {
            $category = Category::findOrFail($id);
---
select * from `categories` where `id` = 1019 limit 1