app/Modules/Backend/ProductManagement/Http/Controllers/ProductController.php

    public function productList(Request $request)
    {
        $draw = $request->get('draw');
        $start = $request->get("start");
        $rowperpage = $request->get("length"); // total number of rows per page

        $columnIndex_arr = $request->get('order');
        $columnName_arr = $request->get('columns');
        $order_arr = $request->get('order');
        $search_arr = $request->get('search');

        $columnIndex = $columnIndex_arr[0]['column']; // Column index
        $columnName = $columnName_arr[$columnIndex]['data']; // Column name
        $columnSortOrder = $order_arr[0]['dir']; // asc or desc
        $searchValue = $search_arr['value']; // Search value

        $query = Product::query();

        //        if (auth('seller')->user() && auth('seller')->user()->getRoleNames()->first() == 'Seller') {
        //            $query
        //                ->where('seller_id', 'like', '%' . auth()->id() . '%');
        //        }
        // Total records
        $totalRecords = $query->count();
---
select count(*) as aggregate from `products` where `products`.`deleted_at` is null

                ->orWhere('total_viewed', 'like', '%' . $searchValue . '%');
            $totalRecordswithFilter = $query->count();
        }
        $records = $query
            ->with('productstock.color','productstock.size','images')
            ->withSum('orders', 'qty')
            ->orderBy($columnName, $columnSortOrder)
            ->skip($start)
            ->take($rowperpage)
            ->get();
---
select * from `colors` where 0 = 1
select * from `productstocks` where `productstocks`.`product_id` in (727, 728, 729, 730, 731, 733, 734, 735, 736, 737)
select * from `sizes` where 0 = 1

    public function create()
    {
        $categories = Category::select('id', 'name', 'category_id')->where('is_active', 1)->orderBy('id', 'asc')->get();
        $categories = $this->decendentCategory($categories->toArray(), null);
        $categories = json_decode(json_encode($categories), FALSE);
        $brands = Brand::select('id', 'name')->where('is_active', 1)->orderBy('id', 'desc')->get();
        $sellers = Seller::where('is_active', 1)->get();
        $pro = Product::orderBy('id', 'desc')->first();
        $sku = 'MS' . str_pad($pro->id??0 + 1, "0", STR_PAD_LEFT);
        $colors = Color::where('is_active', 1)->get();
        $sizes = Size::where('is_active', 1)->get();
---
select `id`, `name`, `category_id` from `categories` where `is_active` = 1 and `categories`.`deleted_at` is null order by `id` asc
select `id`, `name` from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null order by `id` desc
select * from `sellers` where `is_active` = 1 and `sellers`.`deleted_at` is null
select * from `products` where `products`.`deleted_at` is null order by `id` desc limit 1
select * from `colors` where `is_active` = 1
select * from `sizes` where `is_active` = 1

    public function edit($id)
    {
        $product = Product::with('details', 'images', 'video', 'productstock')->findOrFail($id);
        $categories = Category::select('id', 'name', 'category_id')->where('is_active', 1)->orderBy('id', 'asc')->get();
        $categories = $this->decendentCategory($categories->toArray());
        $categories = json_decode(json_encode($categories), FALSE);
        $brands = Brand::select('id', 'name')->where('is_active', 1)->orderBy('id', 'desc')->get();
        $sellers = Seller::latest()->get();
        $colors = Color::where('is_active', 1)->get();
        $sizes = Size::where('is_active', 1)->get();
---
select * from `products` where `products`.`id` = '734' and `products`.`deleted_at` is null limit 1
select * from `productstocks` where `productstocks`.`product_id` in (734)
select `id`, `name`, `category_id` from `categories` where `is_active` = 1 and `categories`.`deleted_at` is null order by `id` asc
select `id`, `name` from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null order by `id` desc
select * from `sellers` where `sellers`.`deleted_at` is null order by `created_at` desc
select * from `colors` where `is_active` = 1
select * from `sizes` where `is_active` = 1