app/Http/Controllers/Frontend/FrontController.php

select * from `categories` where `is_active` = 1 and `show_in_home` = 1 and `categories`.`deleted_at` is null order by `order` asc
select * from `products` where `products`.`category_id` in (3, 6, 7, 9, 558, 559, 574, 618, 622, 623, 626, 628, 630, 632, 637, 742, 744, 747, 762, 768, 769, 770, 781, 782, 783, 784, 785, 786, 787, 788, 791, 792, 793, 794, 795, 796, 798, 799, 800, 801, 802, 803, 807, 808, 809, 810, 811, 812, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 890, 891, 892, 893, 894, 895, 896, 897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922, 923, 924, 925, 926, 928, 929, 930, 931, 932, 933, 934, 935, 936, 937, 938, 940, 941, 942, 943, 944, 945, 946, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 961, 965, 966, 967, 968, 969, 971, 972, 973, 976, 980, 981, 982, 983, 984, 985, 986, 987, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999, 1000, 1001, 1002, 1003, 1004, 1005, 1006, 1018) and `products`.`deleted_at` is null order by quantity = 0, quantity
select * from `products` where `products`.`id` in (674, 679, 680, 696) and `products`.`deleted_at` is null
---
    public function index(): View
    {
        $brands = Brand::query()
            ->active()
            ->orderBy('order')
            ->take(20)
            ->get();

        /** Category collection section */
        $categories = $this->categories();

        /** show product list by category */
        $shopCategories = Category::query()
            ->with('products.images', 'products.details')
            ->where('is_active', 1)
            ->where('show_in_home', 1)
            ->orderBy('order')
            ->get();

        /** Promotion Position One */
        $bannerAds = Promotion::query()
            ->with('product.images', 'product.reviews')
            ->eligible()
            ->where('position', 1)
            ->orderByDesc('id')
            ->take(4)
            ->get();

select * from `banners` where `is_active` = 1 and `publish_stat` = 1 and (`expire_at` > '2024-02-06 12:15:21' or `expire_at` is null) and `banners`.`deleted_at` is null order by `id` desc limit 5
select * from `categories` where `categories`.`id` in (5) and `categories`.`deleted_at` is null
select * from `products` where `is_active` = 1 and `products`.`deleted_at` is null order by RAND() limit 6
select * from `products` where `is_active` = 1 and `products`.`deleted_at` is null order by `created_at` desc limit 6
select * from `products` where exists (select * from `product_details` where `products`.`id` = `product_details`.`product_id` and `is_featured` = 1) and `products`.`deleted_at` is null order by RAND() limit 6
select * from `products` where `products`.`deleted_at` is null order by RAND() limit 6
select * from `notices` where `published_at` < '2024-02-06 12:15:21' and `is_active` = 1 order by `created_at` desc limit 1
select * from `products` where exists (select * from `product_details` where `products`.`id` = `product_details`.`product_id` and `is_flash_deal` = 1 and `flash_start_at` <= '2024-02-06' and `flash_end_at` >= '2024-02-06' order by `flash_end_at` desc) and `products`.`deleted_at` is null
---
            ->first();

        /** promotional slider contents queries */
        $banners = Banner::query()
            ->with('category')
            ->where('is_active', 1)
            ->where('publish_stat', 1)
            ->where(function ($q) {
                $q->where('expire_at', '>', now())->orWhere('expire_at', null);
            })
            ->orderByDesc('id')
            ->limit(5)
            ->get();

        /** "Deal of the day" product's query start */
        $allProducts = Product::query()
            ->with('images', 'details', 'reviews')
            ->where('is_active', 1)
            ->inRandomOrder()
            ->take(6)
            ->get();

        $newArrivals = Product::query()
            ->with('images', 'details', 'reviews')
            ->where('is_active', 1)
            ->orderByDesc('created_at')
            ->take(6)
            ->get();

        $bestSellers = Product::query()
            ->with('images', 'details', 'reviews')
            ->where('is_active', 1)
            ->inRandomOrder()
            ->take(6)
            ->get();

        $featureProducts = Product::query()
            ->with('images', 'details', 'reviews')
            ->whereHas('details', function ($q) {
                $q->where('is_featured', 1);
            })
            ->inRandomOrder()
            ->take(6)
            ->get();

        $trends = Product::query()
            ->with('images', 'details', 'reviews')
            ->inRandomOrder()
            ->take(6)
            ->get();
        /** Deal of the day product's query end */

        $notice = Notice::query()
            ->where('published_at', '<', now())
            ->where('is_active', 1)
            ->latest()
            ->first();

        $flashDeals = Product::with('images', 'reviews', 'details')->whereHas('details', function($q){
            $q->where('is_flash_deal',1)
                ->where('flash_start_at', '<=', date('Y-m-d'))
                ->where('flash_end_at', '>=', date('Y-m-d'))
                ->orderByDesc('flash_end_at');
        })->get();

select * from `categories` where `is_active` = 1 and `category_id` is null and `categories`.`deleted_at` is null order by `order` asc limit 16
---
    public function categories(): Collection
    {
        return Category::query()
            ->where('is_active', 1)
            ->orderBy('order')
            ->where('category_id', null)
            ->take(16)
            ->get();