app/Models/Frontend/helpers.php

function menus(): Collection
{
    $menus = Category::query()
        ->with('subCategories.subCategories')
        ->whereNull('category_id')
        ->where('is_active', 1)
        ->orderBy('order')
        ->take(10)
        ->get();
---
select * from `categories` where `categories`.`category_id` in (3, 6, 7, 9, 558, 559, 574, 936, 937, 938) and `categories`.`deleted_at` is null order by `order` asc

function menubars(): Collection
{
    $menubars = Category::query()
        ->where('is_active', 1)
        ->where('for_menu', 1)
        ->orderBy('order')
        ->take(10)
        ->get();
---
select * from `categories` where `is_active` = 1 and `for_menu` = 1 and `categories`.`deleted_at` is null order by `order` asc limit 10

function maanMenus($position)
{
    if($position == 1){
        $menus = Menu::query()
            ->where('is_header_menu',1)
            ->get();
    }elseif($position == 2){
        $menus = Menu::query()
            ->where('is_footer_menu',1)
            ->where('is_quick_link',1)
            ->get();
    }elseif($position == 3){
        $menus = Menu::query()
            ->where('is_footer_menu',1)
            ->where('is_informatics',1)
            ->get();
---
select * from `menus` where `is_footer_menu` = 1 and `is_quick_link` = 1
select * from `menus` where `is_footer_menu` = 1 and `is_informatics` = 1

function currencies(): Collection
{
    return Currency::query()->where('is_active',1)->get();
---
select * from `currencies` where `is_active` = 1

function hasPromotion($product): bool
{
    return Promotion::query()->where('product_id',$product)
        ->where(function($q){
            $q->where('expire_at','>',now())->orWhere('expire_at',null);
        })
        ->where('is_active',1)
        ->where('is_approve',1)
        ->exists();
---
select exists(select * from `promotions` where `product_id` = 737 and (`expire_at` > '2024-02-06 12:15:21' or `expire_at` is null) and `is_active` = 1 and `is_approve` = 1 and `promotions`.`deleted_at` is null) as `exists`

function promotionPrice($product)
{
    $p = Promotion::query()->where('product_id',$product)
        ->where(function($q){
            $q->where('expire_at','>',now())->orWhere('expire_at',null);
        })
        ->where('is_active',1)
        ->where('is_approve',1)
        ->latest()
        ->first();
---
select * from `promotions` where `product_id` = 696 and (`expire_at` > '2024-02-06 12:15:21' or `expire_at` is null) and `is_active` = 1 and `is_approve` = 1 and `promotions`.`deleted_at` is null order by `created_at` desc limit 1

function uniBoxSuggestions()
{
    return Product::query()
        ->with('images')
        ->orderByDesc('total_viewed')
        ->take(2)
        ->get();
---
select * from `products` where `products`.`deleted_at` is null order by `total_viewed` desc limit 2

function languages(): Collection
{
    return Language::query()->where('is_active',1)->get();
---
select * from `languages` where `is_active` = 1

function lang($key)
{
    $lang = json_decode(Cookie::get('language'));

    if(!$lang){
        $lang = Language::query()->where('default',1)->first();
---
select * from `languages` where `default` = 1 limit 1