app/Http/Controllers/Backend/WebsiteSettingController.php

select * from `headers` where `headers`.`id` = 1 limit 1
---
    public function header()
    {
        $header = Header::find(1);

select * from `web_appearances` where `web_appearances`.`id` = 1 limit 1
select * from `currencies` where `is_active` = 1
select * from `countries` where `is_active` = 1
---
    public function appearance()
    {
        $appearance = WebAppearance::query()->findOrFail(1);
        $currencies = Currency::query()->where('is_active', 1)->get();
        $countries = Country::query()->where('is_active', 1)->get();